



Networking Working Group                                  P. Psenak, Ed.
Internet-Draft                                               C. Filsfils
Updates: 7370 (if approved)                                Cisco Systems
Intended status: Standards Track                             A. Bashandy
Expires: November 22, 2021                                    Individual
                                                             B. Decraene
                                                                  Orange
                                                                   Z. Hu
                                                     Huawei Technologies
                                                            May 21, 2021


    IS-IS Extensions to Support Segment Routing over IPv6 Dataplane
                 draft-ietf-lsr-isis-srv6-extensions-15

Abstract

   The Segment Routing (SR) architecture allows flexible definition of
   the end-to-end path by encoding it as a sequence of topological
   elements called "segments".  It can be implemented over the MPLS or
   the IPv6 data plane.  This document describes the IS-IS extensions
   required to support Segment Routing over the IPv6 data plane.

   This document updates RFC 7370 by modifying an existing registry.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."




Psenak, et al.          Expires November 22, 2021               [Page 1]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   This Internet-Draft will expire on November 22, 2021.

Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  SRv6 Capabilities sub-TLV . . . . . . . . . . . . . . . . . .   4
   3.  Advertising Supported Algorithms  . . . . . . . . . . . . . .   4
   4.  Advertising Maximum SRv6 SID Depths . . . . . . . . . . . . .   5
     4.1.  Maximum Segments Left MSD Type  . . . . . . . . . . . . .   5
     4.2.  Maximum End Pop MSD Type  . . . . . . . . . . . . . . . .   5
     4.3.  Maximum H.Encaps MSD Type . . . . . . . . . . . . . . . .   5
     4.4.  Maximum End D MSD Type  . . . . . . . . . . . . . . . . .   6
   5.  SRv6 SIDs and Reachability  . . . . . . . . . . . . . . . . .   6
   6.  Advertising Anycast Property  . . . . . . . . . . . . . . . .   7
   7.  Advertising Locators and End SIDs . . . . . . . . . . . . . .   8
     7.1.  SRv6 Locator TLV Format . . . . . . . . . . . . . . . . .   9
     7.2.  SRv6 End SID sub-TLV  . . . . . . . . . . . . . . . . . .  10
   8.  Advertising SRv6 Adjacency SIDs . . . . . . . . . . . . . . .  12
     8.1.  SRv6 End.X SID sub-TLV  . . . . . . . . . . . . . . . . .  12
     8.2.  SRv6 LAN End.X SID sub-TLV  . . . . . . . . . . . . . . .  14
   9.  SRv6 SID Structure Sub-Sub-TLV  . . . . . . . . . . . . . . .  16
   10. Advertising Endpoint Behaviors  . . . . . . . . . . . . . . .  17
   11. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  18
     11.1.  SRv6 Locator TLV . . . . . . . . . . . . . . . . . . . .  18
       11.1.1.  SRv6 End SID sub-TLV . . . . . . . . . . . . . . . .  18
       11.1.2.  Revised sub-TLV table  . . . . . . . . . . . . . . .  18
     11.2.  SRv6 Capabilities sub-TLV  . . . . . . . . . . . . . . .  19
     11.3.  Sub-Sub-TLVs of the SRv6 Capability sub-TLV  . . . . . .  19
     11.4.  SRv6 End.X SID and SRv6 LAN End.X SID sub-TLVs . . . . .  19
     11.5.  MSD Types  . . . . . . . . . . . . . . . . . . . . . . .  20
     11.6.  Sub-Sub-TLVs for SID Sub-TLVs  . . . . . . . . . . . . .  20
     11.7.  Prefix Attribute Flags Sub-TLV . . . . . . . . . . . . .  21
     11.8.  ISIS SRv6 Capabilities sub-TLV Flags Registry  . . . . .  21



Psenak, et al.          Expires November 22, 2021               [Page 2]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


     11.9.  ISIS SRv6 Locator TLV Flags Registry . . . . . . . . . .  21
     11.10. ISIS SRv6 End SID sub-TLV Flags Registry . . . . . . . .  22
     11.11. ISIS SRv6 End.X SID and LAN End.X SID sub-TLVs Flags
            Registry . . . . . . . . . . . . . . . . . . . . . . . .  22
   12. Security Considerations . . . . . . . . . . . . . . . . . . .  23
   13. Contributors  . . . . . . . . . . . . . . . . . . . . . . . .  23
   14. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  24
   15. References  . . . . . . . . . . . . . . . . . . . . . . . . .  25
     15.1.  Normative References . . . . . . . . . . . . . . . . . .  25
     15.2.  Informative References . . . . . . . . . . . . . . . . .  27
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  27

1.  Introduction

   With Segment Routing (SR) [RFC8402], a node steers a packet through
   an ordered list of instructions, called segments.

   Segments are identified through Segment Identifiers (SIDs).

   Segment Routing can be directly instantiated on the IPv6 data plane
   through the use of the Segment Routing Header defined in [RFC8754].
   SRv6 refers to this SR instantiation on the IPv6 dataplane.

   The network programming paradigm [RFC8986] is central to SRv6.  It
   describes how any behavior can be bound to a SID and how any network
   program can be expressed as a combination of SIDs.

   This document specifies IS-IS extensions that allow the IS-IS
   protocol to encode some of these SIDs and their behaviors.

   Familiarity with the network programming paradigm [RFC8986] is
   necessary to understand the extensions specified in this document.

   The new SRv6 Locator top level TLV announces SRv6 locators - a form
   of summary address for the set of topology/algorithm-specific SIDs
   instantiated at the node.

   The SRv6 Capabilities sub-TLV announces the ability to support SRv6.

   Several new sub-TLVs are defined to advertise various SRv6 Maximum
   SID Depths.

   The SRv6 End SID sub-TLV, the SRv6 End.X SID sub-TLV, and the SRv6
   LAN End.X SID sub-TLV are used to advertise which SIDs are
   instantiated at a node and what Endpoint behavior is bound to each
   instantiated SID.





Psenak, et al.          Expires November 22, 2021               [Page 3]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   This document updates [RFC7370] by modifying an existing registry
   (Section 11.1.2).

2.  SRv6 Capabilities sub-TLV

   A node indicates that it supports the SR Segment Endpoint Node
   functionality as specified in [RFC8754] by advertising a new SRv6
   Capabilities sub-TLV of the router capabilities TLV [RFC7981].

   The SRv6 Capabilities sub-TLV may contain optional sub-sub-TLVs.  No
   sub-sub-TLVs are currently defined.

   The SRv6 Capabilities sub-TLV has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Type        |     Length    |            Flags              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   optional sub-sub-TLVs...

     Type: 25

     Length: 2 + length of sub-sub-TLVs

     Flags: 2 octets  The following flags are defined:

      0                   1
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | |O|       Reserved            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      where:

        O-flag: If set, the router supports use of the O-bit
        in the Segment Routing Header (SRH) as defined in
        [I-D.ietf-6man-spring-srv6-oam].

        The remaining bits, including bit 0, are reserved for future use. They MUST be
        set to zero on transmission and MUST be ignored on receipt.


3.  Advertising Supported Algorithms

   An SRv6 capable router indicates supported algorithm(s) by
   advertising the Segment Routing Algorithm sub-TLV as defined in
   [RFC8667].



Psenak, et al.          Expires November 22, 2021               [Page 4]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


4.  Advertising Maximum SRv6 SID Depths

   [RFC8491] defines the means to advertise node/link specific values
   for Maximum SID Depths (MSD) of various types.  Node MSDs are
   advertised in a sub-TLV of the Router Capabilities TLV [RFC7981].
   Link MSDs are advertised in a sub-TLV of TLVs 22, 23, 25, 141, 222,
   and 223.

   This document defines the relevant SRv6 MSDs and requests MSD type
   assignments in the MSD Types registry created by [RFC8491].

4.1.  Maximum Segments Left MSD Type

   The Maximum Segments Left MSD Type signals the maximum value of the
   "Segments Left" field [RFC8754] in the SRH of a received packet
   before applying the Endpoint behavior associated with a SID.

      SRH Max Segments Left Type: 41

      If no value is advertised, the supported value is 0.

4.2.  Maximum End Pop MSD Type

   The Maximum End Pop MSD Type signals the maximum number of SIDs in
   the SRH to which the router can apply "Penultimate Segment Pop of the
   SRH" or "Ultimate Segment Pop of the SRH" behavior, as defined in
   [RFC8986] flavors.

      SRH Max End Pop Type: 42

      If the advertised value is zero or no value is advertised,
      then the router cannot apply PSP or USP flavors.

4.3.  Maximum H.Encaps MSD Type

   The Maximum H.Encaps MSD Type signals the maximum number of SIDs that
   can be added to the Segment List of an SRH as part of the "H.Encaps"
   behavior as defined in [RFC8986].

   SRH Max H.encaps Type: 44

   If the advertised value is zero or no value is advertised, then the
   headend can apply an SR Policy that only contains one segment, without
   inserting any SRH header.

   A non-zero SRH Max H.encaps MSD indicates that the headend can insert
   an SRH up to the advertised number of SIDs.




Psenak, et al.          Expires November 22, 2021               [Page 5]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


4.4.  Maximum End D MSD Type

   The Maximum End D MSD Type specifies the maximum number of SIDs
   present in an SRH when performing decapsulation.  As specified in
   [RFC8986] the permitted SID types include, but are not limited to
   End.DX6, End.DT4, End.DT46, End with USD, End.X with USD.

      SRH Max End D Type: 45

      If the advertised value is zero or no value is advertised
      then the router cannot apply any behavior that results in
      decapsulation and forwarding of the inner packet if the
      outer IPv6 header contains an SRH.

5.  SRv6 SIDs and Reachability

   As discussed in [RFC8986], an SRv6 Segment Identifier (SID) is 128
   bits and consists of Locator, Function and Argument parts.

   A node is provisioned with topology/algorithm specific locators for
   each of the topology/algorithm pairs supported by that node.  Each
   locator is a covering prefix for all SIDs provisioned on that node
   which have the matching topology/algorithm.

   Locators MUST be advertised in the SRv6 Locator TLV (see
   Section 7.1).  Forwarding entries for the locators advertised in the
   SRv6 Locator TLV MUST be installed in the forwarding plane of
   receiving SRv6 capable routers when the associated topology/algorithm
   is supported by the receiving node.  The processing of the prefix
   advertised in the SRv6 Locator TLV, the calculation of its
   reachability and the installation in the forwarding plane follows the
   process defined for the Prefix Reachability TLV 236 [RFC5308], or TLV
   237 [RFC5120].

   Locators associated with algorithm 0 and 1 (for all supported
   topologies) SHOULD be advertised in a Prefix Reachability TLV (236 or
   237) so that legacy routers (i.e., routers which do not support SRv6)
   will install a forwarding entry for algorithm 0 and 1 SRv6 traffic.

   In cases where the same prefix, with the same prefix-length, Multi
   Topology ID (MT ID), and algorithm is received in both a Prefix
   Reachability TLV and an SRv6 Locator TLV, the Prefix Reachability
   advertisement MUST be preferred when installing entries in the
   forwarding plane.  This is to prevent inconsistent forwarding entries
   between SRv6 capable and SRv6 incapable routers.  Such preference of
   Prefix Reachability advertisement does not have any impact on the
   rest of the data advertised in the SRv6 Locator TLV.




Psenak, et al.          Expires November 22, 2021               [Page 6]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   Locators associated with Flexible Algorithms (see Section 4 of
   [I-D.ietf-lsr-flex-algo]) SHOULD NOT be advertised in Prefix
   Reachability TLVs (236 or 237).  Advertising the Flexible Algorithm
   locator in regular Prefix Reachability TLV (236 or 237) would make
   the forwarding for it to follow algo 0 path.

   SRv6 SIDs are advertised as sub-TLVs in the SRv6 Locator TLV except
   for SRv6 SIDs which are associated with a specific Neighbor/Link and
   are therefore advertised as sub-TLVs in TLVs 22, 23, 25, 141, 222,
   and 223.

   SRv6 SIDs received from other nodes are not directly routable and
   MUST NOT be installed in the forwarding plane.  Reachability to SRv6
   SIDs depends upon the existence of a covering locator.

   Adherence to the rules defined in this section will assure that SRv6
   SIDs associated with a supported topology/algorithm pair will be
   forwarded correctly, while SRv6 SIDs associated with an unsupported
   topology/algorithm pair will be dropped.  NOTE: The drop behavior
   depends on the absence of a default/summary route covering a given
   locator.

   In order for forwarding to work correctly, the locator associated
   with SRv6 SID advertisements must be the longest match prefix
   installed in the forwarding plane for those SIDs.  In order to ensure
   correct forwarding, network operators should take steps to make sure
   that this requirement is not compromised.  For example, the following
   situations should be avoided:

   o  Another locator associated with a different topology/algorithm is
      the longest match

   o  Another prefix advertisement (i.e., from TLV 236 or 237) is the
      longest match

6.  Advertising Anycast Property

   Both prefixes and SRv6 Locators may be configured as anycast and as
   such the same value can be advertised by multiple routers.  It is
   useful for other routers to know that the advertisement is for an
   anycast identifier.

   A new flag in Prefix Attribute Flags Sub-TLV [RFC7794] is defined to
   advertise the anycast property:







Psenak, et al.          Expires November 22, 2021               [Page 7]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


       Bit #: 4
       Name: Anycast Flag (A-flag)

       When the prefix/SRv6 locator is configured as anycast, the A-flag
       SHOULD be set. Otherwise, this flag MUST be clear.


   The A-flag MUST be preserved when the advertisement is leaked between
   levels.

   The A-flag and the N-flag MUST NOT both be set.  If both N-flag and
   A-flag are set in the prefix/SRv6 Locator advertisement, the
   receiving routers MUST ignore the N-flag.

   The same prefix/SRv6 Locator can be advertised by multiple routers.
   If at least one of them sets the A-Flag in its advertisement, the
   prefix/SRv6 Locator SHOULD be considered as anycast.

   A prefix/SRv6 Locator that is advertised by a single node and without
   an A-Flag is considered node specific.

   All the nodes advertising the same anycast locator MUST instantiate
   the exact same set of SIDs under that anycast locator.  Failure to do
   so may result in traffic being black-holed or mis-routed.

   The Prefix Attribute Flags Sub-TLV can be carried in the SRv6 Locator
   TLV as well as the Prefix Reachability TLVs.  When a router
   originates both the Prefix Reachability TLV and the SRv6 Locator TLV
   for a given prefix, and the router is originating the Prefix
   Attribute Flags Sub-TLV in one of the TLVs, the router SHOULD
   advertise the same flags in the Prefix Attribute Flags Sub-TLV in
   both TLVs.  However, unlike TLVs 236 [RFC5308] and 237 [RFC5120] the
   X-flag in the Prefix Attributes Flags sub-TLV is valid when sent in
   the SRv6 Locator TLV.  The state of the X-flag in the Prefix
   Attributes Flags sub-TLV when included in the Locator TLV MUST match
   the setting of the embedded "X-bit" in any advertisement for the same
   prefix in TLVs 236 [RFC5308] and 237 [RFC5120].  In case of any
   inconsistency between the Prefix Attribute Flags advertised in the
   Locator TLV and in the Prefix Reachability TLV, the ones advertised
   in Prefix Reachability TLV MUST be preferred.

7.  Advertising Locators and End SIDs

   The SRv6 Locator TLV is introduced to advertise SRv6 Locators and End
   SIDs associated with each locator.

   This new TLV shares the sub-TLV space defined for TLVs 135, 235, 236
   and 237.



Psenak, et al.          Expires November 22, 2021               [Page 8]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


7.1.  SRv6 Locator TLV Format

   The SRv6 Locator TLV has the following format:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Type        |     Length    |R|R|R|R|    MT ID              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                   Locator Entries . . .                       |

      Type: 27

      Length: variable.

      R bits: reserved for future use.  They MUST be set to zero on
      transmission and MUST be ignored on receipt.

      MT ID: Multitopology Identifier as defined in [RFC5120].  Note
      that the value 0 is legal.

   Followed by one or more locator entries of the form:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Metric                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Flags       |  Algorithm    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  Loc Size     | Locator (variable)...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  Sub-TLV-len  |         Sub-TLVs (variable) . . .             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Metric: 4 octets.  As described in Section 4 of [RFC5305].

      Flags: 1 octet.  The following flags are defined:

          0
          0 1 2 3 4 5 6 7
         +-+-+-+-+-+-+-+-+
         |D|    Reserved |
         +-+-+-+-+-+-+-+-+

         D-flag: Same as described in section 4.1. of [RFC5305].





Psenak, et al.          Expires November 22, 2021               [Page 9]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


         The remaining bits are reserved for future use.  They MUST be
         set to zero on transmission and MUST be ignored on receipt.

      Algorithm: 1 octet.  As defined in IGP Algorithm Types registry
      [RFC8665].

      Loc-Size: 1 octet.  Number of bits in the SRv6 Locator field.
      MUST be from the range (1 - 128).  The TLV MUST be ignored if the
      Loc-Size is outside this range.

      Locator: 1-16 octets.  This field encodes the advertised SRv6
      Locator.  The Locator is encoded in the minimal number of octets
      for the given number of bits.  Trailing bits MUST be set to zero
      and ignored when received.

      Sub-TLV-length: 1 octet.  Number of octets used by sub-TLVs.

      Optional sub-TLVs: Supported sub-TLVs are specified in
      Section 11.1.2.  Any Sub-TLV that is not allowed in the SRv6
      Locator TLV MUST be ignored.

   Prefix Attribute Flags Sub-TLV [RFC7794] SHOULD be included in the
   Locator TLV.

   Prefix Attribute Flags Sub-TLV MUST be included in the the Locator
   TLV when it is leaked upwards in the hierarchy or originated as a
   result of the redistribution from another protocol or another ISIS
   instance.  If the Prefix Attribute Flags Sub-TLV is not included in
   these cases, receivers will be unable to determine the correct source
   of the advertisement.  The receivers will be unable to detect the
   violation.

7.2.  SRv6 End SID sub-TLV

   The SRv6 End SID sub-TLV is introduced to advertise SRv6 Segment
   Identifiers (SID) with Endpoint behaviors which do not require a
   particular neighbor in order to be correctly applied.  SRv6 SIDs
   associated with a neighbor are advertised using the sub-TLVs defined
   in Section 8.

   Supported behavior values, together with parent TLVs in which they
   are advertised, are specified in Section 10 of this document.  Please
   note that not all behaviors defined in [RFC8986] are defined in this
   document, e.g.  END.T is not.

   This new sub-TLV is advertised in the SRv6 Locator TLV defined in the
   previous section.  SRv6 End SIDs inherit the topology/algorithm from
   the parent locator.



Psenak, et al.          Expires November 22, 2021              [Page 10]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   The SRv6 End SID sub-TLV has the following format:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Type       |     Length    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Flags      |       Endpoint Behavior       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (128 bits) . . .                                          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |Sub-sub-TLV-len|         Sub-sub-TLVs (variable) . . .         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Type: 5.

      Length: variable.

      Flags: 1 octet.  No flags are currently defined.  All bits are
      reserved for future use.  They MUST be set to zero on transmission
      and MUST be ignored on receipt.

      Endpoint Behavior: 2 octets, as defined in [RFC8986].  Supported
      behavior values for this sub-TLV are defined in Section 10 of this
      document.  Unsupported or unrecognized behavior values are ignored
      by the receiver.

      SID: 16 octets.  This field encodes the advertised SRv6 SID.

      Sub-sub-TLV-length: 1 octet.  Number of octets used by sub-sub-
      TLVs.

      Optional Sub-sub-TLVs: Supported Sub-sub-TLVs are specified in
      Section 11.6.  Any Sub-sub-TLV that is not allowed in SRv6 End SID
      sub-TLV MUST be ignored.

   The SRv6 End SID MUST be allocated from its associated locator.  SRv6
   End SIDs that are not allocated from the associated locator MUST be
   ignored.

   Multiple SRv6 End SIDs MAY be associated with the same locator.  In
   cases where the number of SRv6 End SID sub-TLVs exceeds the capacity



Psenak, et al.          Expires November 22, 2021              [Page 11]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   of a single TLV, multiple Locator TLVs for the same locator MAY be
   advertised.  For a given MTID/Locator the algorithm MUST be the same
   in all TLVs.  If this restriction is not met all TLVs for that MTID/
   Locator MUST be ignored.

8.  Advertising SRv6 Adjacency SIDs

   Certain SRv6 Endpoint behaviors [RFC8986] are associated with a
   particular adjacency.

   This document defines two new sub-TLVs of TLV 22, 23, 25, 141, 222,
   and 223 - namely "SRv6 End.X SID sub-TLVs" and "SRv6 LAN End.X SID
   sub-TLVs".

   IS-IS Neighbor advertisements are topology specific - but not
   algorithm specific.  SIDs advertised in SRv6 End.X SID and SRv6 LAN
   End.X SID sub-TLVs therefore inherit the topology from the associated
   neighbor advertisement, but the algorithm is specified in the
   individual SID.

   All SIDs advertised in SRv6 End.X SID and SRv6 LAN End.X SID sub-TLVs
   MUST be a subnet of a Locator with matching topology and algorithm
   which is advertised by the same node in an SRv6 Locator TLV.  SIDs
   that do not meet this requirement MUST be ignored.  This ensures that
   the node advertising these SIDs is also advertising its corresponding
   Locator with the algorithm that will be used for computing paths
   destined to the SID.

8.1.  SRv6 End.X SID sub-TLV

   This sub-TLV is used to advertise an SRv6 SID associated with a point
   to point adjacency.  Multiple SRv6 End.X SID sub-TLVs MAY be
   associated with the same adjacency.

   The SRv6 End.X SID sub-TLV has the following format:
















Psenak, et al.          Expires November 22, 2021              [Page 12]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type        |     Length    |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Flags       |   Algorithm   |   Weight      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Endpoint Behavior      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | SID (128 bits) . . .                                          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | SID (cont . . .)                                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | SID (cont . . .)                                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | SID (cont . . .)                                              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |Sub-sub-tlv-len|         Sub-sub-TLVs (variable) . . .         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


      Type: 43

      Length: variable.

      Flags: 1 octet.


           0 1 2 3 4 5 6 7
          +-+-+-+-+-+-+-+-+
          |B|S|P|Reserved |
          +-+-+-+-+-+-+-+-+

         where:

         B-Flag: Backup flag.  If set, the SID is eligible for
         protection, e.g., using IP Fast Re-route (IPFRR) [RFC5286], as
         described in [RFC8355].

         S-Flag.  Set flag.  When set, the S-Flag indicates that the SID
         refers to a set of adjacencies (and therefore MAY be assigned
         to other adjacencies as well).

         P-Flag.  Persistent flag.  When set, the P-Flag indicates that
         the SID is persistently allocated, i.e., the SID value remains
         consistent across router restart and/or interface flap.





Psenak, et al.          Expires November 22, 2021              [Page 13]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


         Reserved bits: MUST be zero when originated and MUST be ignored
         when received.

      Algorithm: 1 octet.  As defined in IGP Algorithm Types registry
      [RFC8665].

      Weight: 1 octet.  The value represents the weight of the SID for
      the purpose of load balancing.  The use of the weight is defined
      in [RFC8402].

      Endpoint Behavior: 2 octets.  As defined in [RFC8986].  Supported
      behavior values for this sub-TLV are defined in Section 10 of this
      document.  Unsupported or unrecognized behavior values are ignored
      by the receiver.

      SID: 16 octets.  This field encodes the advertised SRv6 SID.

      Sub-sub-TLV-length: 1 octet.  Number of octets used by sub-sub-
      TLVs.

      Optional Sub-sub-TLVs: Supported Sub-sub-TLVs are specified in
      Section 11.6.  Any Sub-sub-TLV that is not allowed in SRv6 End.X
      SID sub-TLV MUST be ignored.

   Note that multiple TLVs for the same neighbor may be required in
   order to advertise all the SRv6 SIDs associated with that neighbor.

8.2.  SRv6 LAN End.X SID sub-TLV

   This sub-TLV is used to advertise an SRv6 SID associated with a LAN
   adjacency.  Since the parent TLV is advertising an adjacency to the
   Designated Intermediate System (DIS) for the LAN, it is necessary to
   include the System ID of the physical neighbor on the LAN with which
   the SRv6 SID is associated.  Given that many neighbors may exist on a
   given LAN, multiple SRv6 LAN END.X SID sub-TLVs may be associated
   with the same LAN.  Note that multiple TLVs for the same DIS neighbor
   may be required in order to advertise all the SRv6 SIDs associated
   with that neighbor.

   The SRv6 LAN End.X SID sub-TLV has the following format:











Psenak, et al.          Expires November 22, 2021              [Page 14]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Type        |     Length    |                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |
      |             Neighbor System-ID (ID length octets)             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Flags       |   Algorithm   |   Weight      |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |       Endpoint Behavior       |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (128 bits) . . .                                          |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      | SID (cont . . .)                                              |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |Sub-sub-TLV-len|      sub-sub-TLVs (variable) . . .            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


      Type: 44

      Length: variable.

      Neighbor System-ID: IS-IS System-ID of length "ID Length" as
      defined in [ISO10589].

      Flags: 1 octet.


           0 1 2 3 4 5 6 7
          +-+-+-+-+-+-+-+-+
          |B|S|P|Reserved |
          +-+-+-+-+-+-+-+-+


         where B,S, and P flags are as described in Section 8.1.
         Reserved bits MUST be zero when originated and MUST be ignored
         when received.

      Algorithm: 1 octet.  As defined in IGP Algorithm Types registry
      [RFC8665].






Psenak, et al.          Expires November 22, 2021              [Page 15]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


      Weight: 1 octet.  The value represents the weight of the SID for
      the purpose of load balancing.  The use of the weight is defined
      in [RFC8402].

      Endpoint Behavior: 2 octets.  As defined in [RFC8986].  Supported
      behavior values for this sub-TLV are defined in Section 10 of this
      document.  Unsupported or unrecognized behavior values are ignored
      by the receiver.

      SID: 16 octets.  This field encodes the advertised SRv6 SID.

      Sub-sub-TLV-length: 1 octet.  Number of octets used by sub-sub-
      TLVs.

      Optional Sub-sub-TLVs: Supported Sub-sub-TLVs are specified in
      Section 11.6.  Any Sub-sub-TLV that is not allowed in SRv6 LAN
      End.X SID sub-TLV MUST be ignored.

   Note that multiple TLVs for the same neighbor, on the same LAN, may
   be required in order to advertise all the SRv6 SIDs associated with
   that neighbor.

9.  SRv6 SID Structure Sub-Sub-TLV

   SRv6 SID Structure Sub-Sub-TLV is an optional Sub-Sub-TLV of:

      SRv6 End SID Sub-TLV (Section 7.2)

      SRv6 End.X SID Sub-TLV (Section 8.1)

      SRv6 LAN End.X SID Sub-TLV (Section 8.2)

   SRv6 SID Structure Sub-Sub-TLV is used to advertise the structure of
   the SRv6 SID as defined in [RFC8986].  It has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Type     |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    LB Length  |  LN Length    | Fun. Length   |  Arg. Length  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 1

      Length: 4 octets.



Psenak, et al.          Expires November 22, 2021              [Page 16]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


      LB Length: 1 octet.  SRv6 SID Locator Block length in bits.

      LN Length: 1 octet.  SRv6 SID Locator Node length in bits.

      Fun. Length: 1 octet.  SRv6 SID Function length in bits.

      Arg. Length: 1 octet.  SRv6 SID Arguments length in bits.

   ISIS SRv6 SID Structure Sub-Sub-TLV MUST NOT appear more than once in
   its parent Sub-TLV.  If it appears more than once in its parent Sub-
   TLV, the parent Sub-TLV MUST be ignored by the receiver.

   The sum of all four sizes advertised in ISIS SRv6 SID Structure Sub-
   Sub-TLV MUST be less than or equal to 128 bits.  If the sum of all
   four sizes advertised in the ISIS SRv6 SID Structure Sub-Sub-TLV is
   larger than 128 bits, the parent Sub-TLV MUST be ignored by the
   receiver.

   The SRv6 SID Structure Sub-Sub-TLV indicates the structure of the SID
   associated with it.  Its usage is outside the scope of this document.

10.  Advertising Endpoint Behaviors

   Endpoint behaviors are defined in [RFC8986].  The codepoints for the
   Endpoint behaviors are defined in the "SRv6 Endpoint Behaviors"
   registry defined in [RFC8986].  If a behavior is advertised it MUST
   only be advertised in the TLV[s] as indicated by "Y" in the table
   below, and MUST NOT be advertised in the TLV[s] as indicated by "N"
   in the table below.

     Endpoint             |Endpoint          | End | End.X | Lan End.X |
     Behavior             |Behavior Codepoint| SID | SID   |   SID     |
    ----------------------|------------------|-----|-------|-----------|
     End   (PSP, USP, USD)| 1-4, 28-31       |  Y  |   N   |    N      |
    ----------------------|------------------|-----|-------|-----------|
     End.X (PSP, USP, USD)| 5-8, 32-35       |  N  |   Y   |    Y      |
    ----------------------|------------------|-----|-------|-----------|
     End.DX6              | 16               |  N  |   Y   |    Y      |
    ----------------------|------------------|-----|-------|-----------|
     End.DX4              | 17               |  N  |   Y   |    Y      |
    ----------------------|------------------|-----|-------|-----------|
     End.DT6              | 18               |  Y  |   N   |    N      |
    ----------------------|------------------|-----|-------|-----------|
     End.DT4              | 19               |  Y  |   N   |    N      |
    ----------------------|------------------|-----|-------|-----------|
     End.DT46             | 20               |  Y  |   N   |    N      |





Psenak, et al.          Expires November 22, 2021              [Page 17]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


11.  IANA Considerations

   This document requests allocation for the following TLVs, sub-TLVs,
   and sub-sub-TLVs as well as updating the ISIS TLV registry and
   defining new registries.

11.1.  SRv6 Locator TLV

   This document makes the following registrations in the IS-IS TLV
   Codepoints registry.

    Type  Description             IIH LSP SNP Purge
    ----  ---------------------   --- --- --- -----
     27   SRv6 Locator TLV         n   y   n    n

11.1.1.  SRv6 End SID sub-TLV

   The SRv6 Locator TLV shares sub-TLV space with TLVs 135, 235, 236 and
   237.  This document updates the "Sub-TLVs for TLVs 135, 235, 236, and
   237 (Extended IP reachability, MT IP.  Reach, IPv6 IP.  Reach, and MT
   IPv6 IP.  Reach TLVs)" registry defined in [RFC7370].  IANA is
   requested to update the name of the "Sub-TLVs for TLVs 135, 235, 236,
   and 237 (Extended IP reachability, MT IP.  Reach, IPv6 IP.  Reach,
   and MT IPv6 IP.  Reach TLVs)" registry to "Sub-TLVs for TLVs 27, 135,
   235, 236, and 237 (SRv6 Locator, Extended IP reachability, MT IP.
   Reach, IPv6 IP.  Reach, and MT IPv6 IP.  Reach TLVs)".

   IANA is asked to add this document as a reference to (renamed) "Sub-
   TLVs for TLVs 27, 135, 235, 236, and 237 (SRv6 Locator, Extended IP
   reachability, MT IP.  Reach, IPv6 IP.  Reach, and MT IPv6 IP.  Reach
   TLVs)" registry.

   This document makes the following registrations in the (renamed)
   "Sub-TLVs for TLVs 27, 135, 235, 236, and 237 (SRv6 Locator, Extended
   IP reachability, MT IP.  Reach, IPv6 IP.  Reach, and MT IPv6 IP.
   Reach TLVs)" registry:

      Type: 5

      Description: SRv6 End SID sub-TLV.

      Reference: This document (Section 7.2).

11.1.2.  Revised sub-TLV table

   The revised table of sub-TLVs for the (renamed) "Sub-TLVs for TLVs
   27, 135, 235, 236, and 237 (SRv6 Locator, Extended IP reachability,




Psenak, et al.          Expires November 22, 2021              [Page 18]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   MT IP.  Reach, IPv6 IP.  Reach, and MT IPv6 IP.  Reach TLVs)"
   registry is shown below:

      Type  27 135 235 236 237

      1     y   y   y   y   y
      2     y   y   y   y   y
      3     n   y   y   y   y
      4     y   y   y   y   y
      5     y   n   n   n   n
      6     n   y   y   y   y
      11    y   y   y   y   y
      12    y   y   y   y   y
      32    n   y   y   y   y

11.2.  SRv6 Capabilities sub-TLV

   This document makes the following registrations in the "Sub-TLVs for
   TLV 242 (IS-IS Router CAPABILITY TLV)":

      Type: 25

      Description: SRv6 Capabilities sub-TLV.

      Reference: This document (Section 2).

11.3.  Sub-Sub-TLVs of the SRv6 Capability sub-TLV

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of sub-TLV types
   for the SRv6 Capability sub-TLV specified in this document -
   Section 2.  The suggested name of the new registry is "sub-sub-TLVs
   of the SRv6 Capability sub-TLV".  The registration procedure is
   "Expert Review" as defined in [RFC8126].  Guidance for the Designated
   Experts is provided in the [RFC7370].  No sub-sub-TLVs are defined by
   this document except for the reserved value.

   0: Reserved

   1-255: Unassigned

11.4.  SRv6 End.X SID and SRv6 LAN End.X SID sub-TLVs

   This document makes the following registrations in the "Sub-TLVs for
   TLVs 22, 23, 25, 141, 222, and 223 (Extended IS reachability, IS
   Neighbor Attribute, L2 Bundle Member Attributes, inter-AS
   reachability information, MT-ISN, and MT IS Neighbor Attribute TLVs)"
   registry:



Psenak, et al.          Expires November 22, 2021              [Page 19]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


      Type: 43

      Description: SRv6 End.X SID sub-TLV.

      Reference: This document (Section 8.1).

      Type: 44

      Description: SRv6 LAN End.X SID sub-TLV.

      Reference: This document (Section 8.2).

      Type  22 23 25 141 222 223

      43     y  y  y  y   y   y
      44     y  y  y  y   y   y


11.5.  MSD Types

   This document makes the following registrations in the IGP MSD-Types
   registry:

   Value    Name                  Reference
   ------------------
    41      SRH Max SL            [This Document]
    42      SRH Max End Pop       [This Document]
    44      SRH Max H.encaps      [This Document]
    45      SRH Max End D         [This Document]

11.6.  Sub-Sub-TLVs for SID Sub-TLVs

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of sub-TLV types
   for the SID Sub-TLVs specified in this document - Section 7.2,
   Section 8.1, Section 8.2.  The suggested name of the new registry is
   "sub-sub-TLVs for SRv6 End SID (5) (sub-TLV of TLVs 27, 135, 235, 236
   and 237) and SRv6 End.X SID (43)/SRv6 LAN End.X SID (44) (Sub-TLVs
   for TLVs 22, 23, 25, 141, 222, and 223)".  The registration procedure
   is "Expert Review" as defined in [RFC8126].  Guidance for the
   Designated Experts is provided in [RFC7370].  The following
   assignments are made by this document:









Psenak, et al.          Expires November 22, 2021              [Page 20]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


    Type   Description                          Encoding
                                                Reference
   ---------------------------------------------------------
    0      Reserved
    1      SRv6 SID Structure Sub-Sub-TLV       [This Document]
    2-255  Unassigned


   Type    5  43 44

    1      y  y  y


11.7.  Prefix Attribute Flags Sub-TLV

   This document adds a new bit in the "Bit Values for Prefix Attribute
   Flags Sub-TLV" registry:

      Bit #: 4

      Description: Anycast Flag (A-flag)

      Reference: This document (Section 6).

11.8.  ISIS SRv6 Capabilities sub-TLV Flags Registry

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of bits 0 to 15 in
   the Flags field of the ISIS SRv6 Capabilities sub-TLV specified in
   this document (Section 2).  The suggested name of the new registry is
   "ISIS SRv6 Capabilities sub-TLV Flags".  The registration procedure
   is "Expert Review" as defined in [RFC8126].  Guidance for the
   Designated Experts is provided in [RFC7370].  The following
   assignments are made by this document:

      Bit #: 1

      Description: O-flag

      Reference: This document (Section 2).

11.9.  ISIS SRv6 Locator TLV Flags Registry

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of bits 0 to 7 in
   the Flags field of the ISIS SRv6 Locator TLV specified in this
   document (Section 7.1).  The suggested name of the new registry is
   "ISIS SRv6 Locator TLV Flags".  The registration procedure is "Expert



Psenak, et al.          Expires November 22, 2021              [Page 21]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   Review" as defined in [RFC8126].  Guidance for the Designated Experts
   is provided in [RFC7370].  The following assignments are made by this
   document:

      Bit #: 0

      Description: D-flag

      Reference: This document (Section 7.1).

11.10.  ISIS SRv6 End SID sub-TLV Flags Registry

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of bits 0 to 7 in
   the Flags field of the ISIS SRv6 End SID sub-TLV specified in this
   document (Section 7.2).  The suggested name of the new registry is
   "ISIS SRv6 End SID sub-TLV Flags".  The registration procedure is
   "Expert Review" as defined in [RFC8126].  Guidance for the Designated
   Experts is provided in [RFC7370].  No assignments are made by this
   document.

11.11.  ISIS SRv6 End.X SID and LAN End.X SID sub-TLVs Flags Registry

   This document requests a new IANA registry be created under the IS-IS
   TLV Codepoints Registry to control the assignment of bits 0 to 7 in
   the Flags field of the ISIS SRv6 End.X SID and LAN End.X SID sub-TLVs
   (Section 8.1 and Section 8.2).  The suggested name of the new
   registry is "ISIS SRv6 End.X SID and LAN End.X SID sub-TLVs Flags".
   The registration procedure is "Expert Review" as defined in
   [RFC8126].  Guidance for the Designated Experts is provided in
   [RFC7370].  The following assignments are made by this document:

      Bit #: 0

      Description: B-flag

      Reference: This document (Section 8.1).

      Bit #: 1

      Description: S-flag

      Reference: This document (Section 8.1).

      Bit #: 2

      Description: P-flag




Psenak, et al.          Expires November 22, 2021              [Page 22]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


      Reference: This document (Section 8.1).

12.  Security Considerations

   Security concerns for IS-IS are addressed in [ISO10589], [RFC5304],
   and [RFC5310].  While IS-IS is deployed under a single administrative
   domain, there can be deployments where potential attackers have
   access to one or more networks in the IS-IS routing domain.  In these
   deployments, the stronger authentication mechanisms defined in the
   aforementioned documents SHOULD be used.

   This document describes the IS-IS extensions required to support
   Segment Routing over an IPv6 data plane.  The security considerations
   for Segment Routing are discussed in [RFC8402].  [RFC8986] defines
   the SRv6 Network Programming concept and specifies the main Segment
   Routing behaviors to enable the creation of interoperable overlays;
   the security considerations from that document apply too.

   The advertisement for an incorrect MSD value may have negative
   consequences, see [RFC8491] for additional considerations.

   Security concerns associated with the setting of the O-flag are
   described in [I-D.ietf-6man-spring-srv6-oam].

   Security concerns associated with the usage of Flex-Algorithms are
   described in [I-D.ietf-lsr-flex-algo]).

13.  Contributors

   The following people gave a substantial contribution to the content
   of this document and should be considered as co-authors:




















Psenak, et al.          Expires November 22, 2021              [Page 23]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


     Stefano Previdi
     Huawei Technologies
     Email: stefano@previdi.net

     Paul Wells
     Cisco Systems
     Saint Paul,
     Minnesota
     United States
     Email: pauwells@cisco.com

     Daniel Voyer
     Email:  daniel.voyer@bell.ca

     Satoru Matsushima
     Email: satoru.matsushima@g.softbank.co.jp

     Bart Peirens
     Email: bart.peirens@proximus.com

     Hani Elmalky
     Email: hani.elmalky@ericsson.com

     Prem Jonnalagadda
     Email: prem@barefootnetworks.com

     Milad Sharif
     Email: msharif@barefootnetworks.com>

     Robert Hanzl
     Cisco Systems
     Millenium Plaza Building, V Celnici 10, Prague 1,
     Prague, Czech Republic
     Email rhanzl@cisco.com

     Ketan Talaulikar
     Cisco Systems, Inc.
     Email: ketant@cisco.com


14.  Acknowledgments

   Thanks to Christian Hopps for his review comments and shepherd work.

   Thanks to Alvaro Retana and John Scudder for AD review and comments.






Psenak, et al.          Expires November 22, 2021              [Page 24]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


15.  References

15.1.  Normative References

   [I-D.ietf-6man-spring-srv6-oam]
              Ali, Z., Filsfils, C., Matsushima, S., Voyer, D., and M.
              Chen, "Operations, Administration, and Maintenance (OAM)
              in Segment Routing Networks with IPv6 Data plane (SRv6)",
              draft-ietf-6man-spring-srv6-oam-10 (work in progress),
              April 2021.

   [I-D.ietf-lsr-flex-algo]
              Psenak, P., Hegde, S., Filsfils, C., Talaulikar, K., and
              A. Gulko, "IGP Flexible Algorithm", draft-ietf-lsr-flex-
              algo-15 (work in progress), April 2021.

   [ISO10589]
              International Organization for Standardization,
              "Intermediate system to Intermediate system intra-domain
              routeing information exchange protocol for use in
              conjunction with the protocol for providing the
              connectionless-mode Network Service (ISO 8473)", Nov 2002.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5120]  Przygienda, T., Shen, N., and N. Sheth, "M-ISIS: Multi
              Topology (MT) Routing in Intermediate System to
              Intermediate Systems (IS-ISs)", RFC 5120,
              DOI 10.17487/RFC5120, February 2008,
              <https://www.rfc-editor.org/info/rfc5120>.

   [RFC5305]  Li, T. and H. Smit, "IS-IS Extensions for Traffic
              Engineering", RFC 5305, DOI 10.17487/RFC5305, October
              2008, <https://www.rfc-editor.org/info/rfc5305>.

   [RFC5308]  Hopps, C., "Routing IPv6 with IS-IS", RFC 5308,
              DOI 10.17487/RFC5308, October 2008,
              <https://www.rfc-editor.org/info/rfc5308>.

   [RFC7370]  Ginsberg, L., "Updates to the IS-IS TLV Codepoints
              Registry", RFC 7370, DOI 10.17487/RFC7370, September 2014,
              <https://www.rfc-editor.org/info/rfc7370>.






Psenak, et al.          Expires November 22, 2021              [Page 25]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   [RFC7794]  Ginsberg, L., Ed., Decraene, B., Previdi, S., Xu, X., and
              U. Chunduri, "IS-IS Prefix Attributes for Extended IPv4
              and IPv6 Reachability", RFC 7794, DOI 10.17487/RFC7794,
              March 2016, <https://www.rfc-editor.org/info/rfc7794>.

   [RFC7981]  Ginsberg, L., Previdi, S., and M. Chen, "IS-IS Extensions
              for Advertising Router Information", RFC 7981,
              DOI 10.17487/RFC7981, October 2016,
              <https://www.rfc-editor.org/info/rfc7981>.

   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing Architecture", RFC 8402, DOI 10.17487/RFC8402,
              July 2018, <https://www.rfc-editor.org/info/rfc8402>.

   [RFC8491]  Tantsura, J., Chunduri, U., Aldrin, S., and L. Ginsberg,
              "Signaling Maximum SID Depth (MSD) Using IS-IS", RFC 8491,
              DOI 10.17487/RFC8491, November 2018,
              <https://www.rfc-editor.org/info/rfc8491>.

   [RFC8665]  Psenak, P., Ed., Previdi, S., Ed., Filsfils, C., Gredler,
              H., Shakir, R., Henderickx, W., and J. Tantsura, "OSPF
              Extensions for Segment Routing", RFC 8665,
              DOI 10.17487/RFC8665, December 2019,
              <https://www.rfc-editor.org/info/rfc8665>.

   [RFC8667]  Previdi, S., Ed., Ginsberg, L., Ed., Filsfils, C.,
              Bashandy, A., Gredler, H., and B. Decraene, "IS-IS
              Extensions for Segment Routing", RFC 8667,
              DOI 10.17487/RFC8667, December 2019,
              <https://www.rfc-editor.org/info/rfc8667>.

   [RFC8754]  Filsfils, C., Ed., Dukes, D., Ed., Previdi, S., Leddy, J.,
              Matsushima, S., and D. Voyer, "IPv6 Segment Routing Header
              (SRH)", RFC 8754, DOI 10.17487/RFC8754, March 2020,
              <https://www.rfc-editor.org/info/rfc8754>.






Psenak, et al.          Expires November 22, 2021              [Page 26]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   [RFC8986]  Filsfils, C., Ed., Camarillo, P., Ed., Leddy, J., Voyer,
              D., Matsushima, S., and Z. Li, "Segment Routing over IPv6
              (SRv6) Network Programming", RFC 8986,
              DOI 10.17487/RFC8986, February 2021,
              <https://www.rfc-editor.org/info/rfc8986>.

15.2.  Informative References

   [RFC5286]  Atlas, A., Ed. and A. Zinin, Ed., "Basic Specification for
              IP Fast Reroute: Loop-Free Alternates", RFC 5286,
              DOI 10.17487/RFC5286, September 2008,
              <https://www.rfc-editor.org/info/rfc5286>.

   [RFC5304]  Li, T. and R. Atkinson, "IS-IS Cryptographic
              Authentication", RFC 5304, DOI 10.17487/RFC5304, October
              2008, <https://www.rfc-editor.org/info/rfc5304>.

   [RFC5310]  Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R.,
              and M. Fanto, "IS-IS Generic Cryptographic
              Authentication", RFC 5310, DOI 10.17487/RFC5310, February
              2009, <https://www.rfc-editor.org/info/rfc5310>.

   [RFC8355]  Filsfils, C., Ed., Previdi, S., Ed., Decraene, B., and R.
              Shakir, "Resiliency Use Cases in Source Packet Routing in
              Networking (SPRING) Networks", RFC 8355,
              DOI 10.17487/RFC8355, March 2018,
              <https://www.rfc-editor.org/info/rfc8355>.

Authors' Addresses

   Peter Psenak (editor)
   Cisco Systems
   Pribinova Street 10
   Bratislava 81109
   Slovakia

   Email: ppsenak@cisco.com


   Clarence Filsfils
   Cisco Systems
   Brussels
   Belgium

   Email: cfilsfil@cisco.com






Psenak, et al.          Expires November 22, 2021              [Page 27]

Internet-Draft            ISIS Srv6 Extensions                  May 2021


   Ahmed Bashandy
   Individual

   Email: abashandy.ietf@gmail.com


   Bruno Decraene
   Orange
   Issy-les-Moulineaux
   France

   Email: bruno.decraene@orange.com


   Zhibo Hu
   Huawei Technologies

   Email: huzhibo@huawei.com

































Psenak, et al.          Expires November 22, 2021              [Page 28]
